[
    {
        "title": "NASA React Fetcher",
        "Description": "This project is a tool created to access the publically accessible NASA API. I love NASA, that's why and there is lots of cool API stuff I want to show people who aren't a techie. From pulling the latest image of Earth, to satellite locating and plotting, it's here!",
        "tags": ["Full Stack", "JavaScript", "Python", "Github Remote Build","HTML & CSS", "React", "NextJS", "Docker", "Teamwork"],
        "identifiers": ["Full-Stack", "JavaScript", "Python", "Remote-Build","HTML-CSS", "React", "React", "Docker", "Teamwork"],
        "link": "https://github.com/FinnianHBLR/NASA-React-Fetcher"
    },
    {
        "title": "AWS S3 Airspace Simulator",
        "Description": "This project was created to use the AWS S3 buckets. It is a flight sync system for virtual planes to AWS servers. This also is designed to have multi-connection support.",
        "tags": ["Back End", "Java", "AWS S3"],
        "identifiers": ["Back-End", "Java", "AWS-S3"],
        "link": "https://github.com/FinnianHBLR/waterbucket-java-aws-s3"

    },
    {
        "title": "Heart Disease Prediction",
        "Description": "Artificial intelligence and data science are areas that I am deeply interested in, and I have studied extensively in them. This project covers areas such as exploratory analysis, data repair with a KNN imputer and full analysis with multiple models. Hypothesis - Is it possible to predict heart disease events?",
        "tags": ["Python", "AI"],
        "identifiers": ["Python", "AI"],
        "link": "https://github.com/FinnianHBLR/Health-Data-Project---Heart-Failure-Prediction"

    },
    {
        "title": "New York Taxi Data Processing Project",
        "Description": "This team project was a data analysis project with taxi data from New York. I worked as the team lead and headed presenting these results. The project I led had three great team members from around the globe! This project was focused on both the analysis and the application of the results to the business itself.",
        "tags": ["Python", "AI", "Teamwork"],
        "identifiers": ["Python", "AI", "Teamwork"],
        "link": "https://github.com/FinnianHBLR/data-science-ml"
    },
    {
        "title": "Data science prediction for SmartBuild",
        "Description": "This data prediction project was another team project I led. This project used data to create models to predict the quality of products based on input parameters. This project was focused on both the prediction models and the application of these models to the business itself.",
        "tags": ["Python", "AI", "Teamwork"],
        "identifiers": ["Python", "AI", "Teamwork"],
        "link": "https://github.com/FinnianHBLR/data-science-prediction"
    },
    {
        "title": "TypeScript DataChanger",
        "Description": "I created this TypeScript project to make sure I knew how TypeScript works. I didn't find it that difficult coming from Java, and I see its use in Node servers. I have had previous experience with TypeScipt, so this was to make sure it all made sense.",
        "tags": ["TypeScript"],
        "identifiers": ["TypeScript"],
        "link": "https://github.com/FinnianHBLR/TS-DataChanger"
    },
    {
        "title": "Nuclear Craft OpenComputer Mainframes Minecraft",
        "Description": "This Lua application was a personal project. It was designed to create an automatic electrical system manager that was powerful and stable. This was coded for a modded version of the video game Minecraft. The Lua code was designed to be run on an in-game computer and was a multi-nuclear reactor, gas turbine peaker plant/backup power source with an automatic diesel starter engine.",
        "tags": ["Lua"],
        "identifiers": ["Lua"],
        "link": "https://github.com/FinnianHBLR/NC-OpenComputer-Mainframes"
    },
    {
        "title": "Student covid data analysis",
        "Description": "At Furtwangen university, I was involved with a project to understand students' needs and concerns during a downturn in student enrollment. I created this project using data analysis techniques to understand and process the student data.",
        "tags": ["Python", "AI"],
        "identifiers": ["Python", "AI"],
        "link": "https://github.com/FinnianHBLR/student-covid-furtwangen-code"
    },    
    {
        "title": "AWS DeepRacer Project",
        "Description": "The Eastern Institute of Technology and Amazon hosted a multi-day AI robot racer competition. I competed in a team, learning about and training unsupervised AI models for the robot racers. Our complex model, complete with self-learnt racing lines, was not working on the day. This was why on the day, under pressure, I wrote another more simple script that landed us 2nd place.",
        "tags": ["Python", "AI", "Teamwork"],
        "identifiers": ["Python", "AI", "Teamwork"],
        "link": "https://github.com/FinnianHBLR/DeepRacerProject"
    },
    {
        "title": "GovHack 2019 Team io Localé",
        "Description": "Awards: StatsNZ Innovation Award, Dean’s Special Award, Civil Defence Best Use of Data in a Civil Emergency, Proaxiom Getting Around 2nd place. - Localé was a tourism-based application designed to connect visitors to local businesses better. We used a Kanban system to develop and design quicker, adding a questions section with a list of questions we needed to ask. This hackathon was a fantastic experience and provided me with many future teamwork skills.",
        "tags": ["Teamwork"],
        "identifiers": ["Teamwork"],
        "link": "https://2019.hackerspace.govhack.org/projects/local"
    },
    {
        "title": "GovHack 2020 Team io Liv City",
        "Description": "This hackathon was conducted online due to COVID-19, however, it was still a great learning experience. We developed an application called LivCity that allows a city to gain community sources of information. Using feedback from the community, the appropriate authorities can develop needed infrastructure in areas or appropriate social services.",
        "tags": ["Teamwork"],
        "identifiers": ["Teamwork"],
        "link": "https://2020.hackerspace.govhack.org/projects/livcity"
    },  
    {
        "title": "MQTT Project",
        "Description": "This IoT project was an encrypted MQTT data transmission project as a part of an IoT project. This project was part of the IoT course I had done at the Eastern Institute of Technology.",
        "tags": ["Python", "IoT"],
        "identifiers": ["Python", "IoT"],
        "link": "https://github.com/FinnianHBLR/MQTT-Assessment-2"
    },
    {
        "title": "PC Builder Memory",
        "Description": "This project was created in 2019 and was an early OOP project. This C# project was a simple card-matching game. Later on, I would go onto Java.",
        "tags": ["C#"],
        "identifiers": ["CSharp"],
        "link": "https://github.com/FinnianHBLR/PCBuilderMemory"
    },
    {
        "title": "My Portfolio",
        "Description": "This portfolio uses mapping, and mapping within that to accomplish most of its functions. These mapping functions correspond to JSON files holding all the information for future ease of use! In the data management of this project, it uses two arrays to process names such as C# and C++ which include special characters. The interface was also developed with mobile devices in mind.",
        "tags": ["React", "HTML & CSS", "JavaScript", "Front End"],
        "identifiers": ["React", "HTML-CSS", "JavaScript", "Front-End"],
        "link": "https://github.com/FinnianHBLR/finnianhblr-portfolio-react"
    }

]