[
    {
        "skill": "Full Stack",
        "identifier": "Full-Stack",
        "image": "Full-Stack",
        "summary": "I have experience writing full-stack applications. This is as I have written applications back-end and front-end. Among personal projects, significantly I completed an internship with the company Fingermark to create a full-stack application using MongoDB, ExspressJS, Socket.io HTML, CSS and JavaScript. I enjoy full-stack development the most as I get to work with a range of different technologies."
    },
    {
        "skill": "Back End",
        "identifier": "Back-End",
        "image": "Back-End",
        "summary": "Back-end development is something I am comfortable with. I have worked in, back-end frameworks such as NodeJS, AWS, Socket.io, Express.JS and NextJS for React development. I have also gained experience in other back-end database technologies such as MongoDB and MySQL."
    },
    {
        "skill": "Front End",
        "identifier": "Front-End",
        "image": "Front-End",
        "summary": "I have significant experience in front-end development. Since 2019 I have been actively creating websites. Later on, I gained experience in technologies such as React to keep up with modern development. For styling and hypertext languages I feel very comfortable with CSS and HTML as well as other front-end libraries such as JQuery and Bootstrap."
    },
    {
        "skill": "Teamwork",
        "identifier": "Teamwork",
        "image": "Teamwork",
        "summary": "I have worked on many team projects often leading. From AI robot cars to multiple Hackathons. I am a hard-working team player and do my best in these environments. I also have no problems getting a group together, leading and presenting our results. Success is important to me, especially when working with other people."
    },{
        "skill": "Indigenous development",
        "identifier": "Indigenous-development",
        "image": "Indigenous-development",
        "summary": "I am from the iwi Ngāti Kahungunu and I have been fortunate to grow up on the land of my tīpuna. I believe Māori are under-represented in technology. I feel it is important to represent Māori values and tikanga in technology, namely around processes and protocols, leadership, language, environment and community."
    },
    {
        "skill": "IT Management",
        "identifier": "IT-Management",
        "image": "IT-Management",
        "summary": "During my work I have worked in IT management. I found it very rewarding, as I could work with people who are not as technologically savvy and get their organisations up to speed. Although, I want to get involved in more technical projects as this is my passion."
    },
    {
        "skill": "AI and Data",
        "identifier": "AI",
        "image": "AI",
        "summary": "Artificial intelligence has as it is always been a passion of mine. During my studies, I studied extensively in the artificial intelligence field. I have experience in many different types of models, data cleaning, exploration and repair. I have also learnt and am comfortable with many Pythion libraries such as Pandas, NumPy, Pandas, Sklearn, SciPy, and Matplotlib."
    },
    {
        "skill": "Python",
        "identifier": "Python",
        "image": "Python",
        "summary": "I have become proficient in Python, especially in data analysis and artificial intelligence. I have been creating Python projects since 2018, starting with robotics and Python is my go-to language for data-related projects."
    },
    {
        "skill": "JavaScript",
        "identifier": "JavaScript",
        "image": "JavaScript",
        "summary": "I used JavaScript extensively in my projects and my Internship, going as far as to make custom libraries to use internally. I have also used NodeJS in many projects. JavaScript is one of my favourite languages to use."
    },
    {
        "skill": "TypeScript",
        "identifier": "TypeScript",
        "image": "TypeScript",
        "summary": "I prefer typed languages because of the issues that adding data types solves, specifically with TypeScript. I have had plenty of development time with TypeScript and can switch between TypeScript and JavaScript. Although, I would like to get more development time with TypeScript."
    },
    {
        "skill": "NodeJS",
        "identifier": "NodeJS",
        "image": "NodeJS",
        "summary": "I have worked often with NodeJS as to me it is similar to Python. I often use NodeJS with the Express.JS library creating APIs for my software. NodeJS was also used in my internship extensively to create an API and webserver."
    },
    {
        "skill": "Databases",
        "identifier": "Databases",
        "image": "Databases",
        "summary": "I have worked with MongoDB in my internship extensively. I have also learnt MYSQL during my studies. I not only have learnt about the database themselves, but I have also learnt and practised database management and design."
    },
    {
        "skill": "Java",
        "identifier": "Java",
        "image": "Java",
        "summary": "For object-oriented languages, I have the most experience in Java. I have been able to best use these skills in my recent Java AWS S3 project. Java is one of my favourite languages to develop in. I know there are areas of Java in which I could improve, but I don’t believe this would be difficult."
    },
    {
        "skill": "AWS S3",
        "identifier": "AWS-S3",
        "image": "AWS-S3",
        "summary": "To learn software concepts I apply them to airports! As they are systems with recognisable objects that can be virtualised. For AWS-S3, I found it relatively simple to apply this concept. I was able to create a simulator in Java that can keep a live save of virtual airport activities online. I want to be able to use this tech in future jobs and projects."
    },
    {
        "skill": "React / NextJS",
        "identifier": "React",
        "image": "React",
        "summary": "As I wanted to keep up to date with the latest tech I learnt React. I am still not at an expert level, but I have created many React applications using many different areas of React development such as States, Hooks and component-driven applications. I also have used NextJS and feel comfortable with the concepts of NextJs development. React and NextJS are technologies I want to continue using in future."
    },
    {
        "skill": "C#",
        "identifier": "CSharp",
        "image": "CSharp",
        "summary": "C# is an OOP language I have got moderate experience with. But C# is a language I want to get more experience with, but my better experience with Java contributes to this as Java and C# share many similarities."
    },
    {
        "skill": "IoT",
        "identifier": "IoT",
        "image": "IoT",
        "summary": "My specialisation is in the IoT (Internet of Things) field. During my studies at the Eastern Institute of Technology, I majored in intelligence, which included IoT. My internship was also in IoT, as we used computer vision in security cameras to create health and safety software. For other areas in IoT, I’ve worked with Arduinos and sensors and PLCs (programmable logic controllers)."
    },
    {
        "skill": "Lua",
        "identifier": "Lua",
        "image": "Lua",
        "summary": "Lua was fun and easy to learn, as it is not too different from other languages I already knew. I leant Lua because it was used in the OpenComputers mod for the game Minecraft. I wanted to automate my electrical grid and I needed a computerised manager. This system was required to manage two nuclear reactors, a gas turbine and a diesel start-up generator. Although relatively simple sounding, it's more complex than it seemed. But extremely fun!"
    },
    {
        "skill": "C++",
        "identifier": "CPlusPlus",
        "image": "CPlusPlus",
        "summary": "I have used C++ in many Arduino projects. Studying with a major in intelligent systems, I created a lot of Arduino C++ code for various robots and IoT projects. Although, I will note that this is an Arduino flavour of C++ and not the same as C++."
    },
    {
        "skill": "HTML & CSS",
        "identifier": "HTML-CSS",
        "image": "HTML-CSS",
        "summary": "HTML and CSS is the first coding I ever did, creating a simple web page! Ever since 2017, I have been using these CSS and HTML."
    },    
    {
        "skill": "Docker",
        "identifier": "Docker",
        "image": "Docker",
        "summary": "I put time into learning Docker on personal projects and at my software development internship at Fingermark. I have learnt to make my own Docker files for React and NodeJS projects. I want to expand my knowledge to Docker for Java programs and learn Kubernetes, but I don’t believe these will be too difficult. "
    },
    {
        "skill": "Github Remote-Build",
        "identifier": "Remote-Build",
        "image": "Remote-Build",
        "summary": "For my projects, I have wanted to learn how to build remotely. This remote building is why I learned how to do this with GitHub actions. Auto building on GitHub was used for the NASA React Fetcher project."
    }
]